# RbsConduitrunDiameterParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsConduitrunDiameterParam Property
ParameterTypeId Class See Also
---
"Diameter(Trade Size)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsConduitrunDiameterParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsConduitrunDiameterParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsConduitrunDiameterParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace